%此程序为CRP正运动学计算,连杆转角和关节角按照实际的CRP机械臂建立,但连杆长度和实际的CRP有偏差
function[ Tout ] = Forward_kinematics(q)
%连杆长度
Tx = [0, -0.1573, -0.0165, -0.2975, -0.3545, 0.0820];   %Tx = [0, 0.1949 , 1.0938e-04 , 0.2000, 0     , -4.7162e-04]; 
Ty = [0, 0.0653, 0.0464, -0.0519, 0.0440, -0.0145];     %Ty =   [0, -0.0951, -0.6137    , 0.2750, 0.0320, 0.0981     ];
Tz = [0, 0, 0.6136, 0.1671, -0.0437, -0.5149];          %Tz =        [0, 0.2850 , 0.0030     , 0.1105, 0.3650, 0.0540     ];
%连杆转角
alpha = [0, pi/2, 0, -pi/2, -pi/2, pi/2];
%关节角
theta = [q(1);q(2)-pi/2;q(3);q(4);q(5)-pi/2;q(6)];
T = zeros(4,4,6);
%先绕x轴旋转再绕z轴旋转
for i = 1:6
    T(:,:,i) = [cos(theta(i)) -sin(theta(i)) 0 Tx(i);
                cos(alpha(i))*sin(theta(i)) cos(alpha(i))*cos(theta(i)) -sin(alpha(i)) Ty(i);
                sin(alpha(i))*sin(theta(i)) sin(alpha(i))*cos(theta(i)) cos(alpha(i)) Tz(i);
                0 0 0 1];
end
%末端执行器相对于惯性系0的变换矩阵
Tout = T(:,:,1) * T(:,:,2) * T(:,:,3) * T(:,:,4) * T(:,:,5) * T(:,:,6);




