function[T] = Modern_Robotics_FKsolver61(q)
%现代机器人学例题6.1的仿真模型
%正运动学指数坐标
M = [1 0 0 2;
     0 1 0 0;
     0 0 1 0;
     0 0 0 1];

w1 = [0;0;1];
w2 = [0;0;1];

q1 = [0;0;0];
q2 = [1;0;0];

v1 = -cross(w1,q1); %线速度
v2 = -cross(w2,q2);

R1 = [0 -w1(3) w1(2);w1(3) 0 -w1(1);-w1(2) w1(1) 0]; %转轴的反对称矩阵
R2 = [0 -w2(3) w2(2);w2(3) 0 -w2(1);-w2(2) w2(1) 0];

G1 = eye(3)*q(1) + (1-cos(q(1)))*R1 + (q(1)-sin(q(1)))*R1^2;  
G2 = eye(3)*q(2) + (1-cos(q(2)))*R2 + (q(2)-sin(q(2)))*R2^2;

Rot1 = eye(3) + sin(q(1))*R1 + (1-cos(q(1)))*R1^2;  %刚体转动的矩阵指数
Rot2 = eye(3) + sin(q(2))*R2 + (1-cos(q(2)))*R2^2; 

eS1 = [Rot1 G1*v1 ;0 0 0 1];%刚体运动的矩阵指数
eS2 = [Rot2 G2*v2 ;0 0 0 1];

T = eS1*eS2*M ;%基于基坐标系的表示
end











